# Day 2: Introduction to Pandas

In [2]:
#Importing libraries
import pandas as pd
import numpy as np

In [3]:
#creating a Series(1 label)
data=pd.Series([20,30,40,55], index=['A','B','C','D'])
print("Series_example:")
print(data)

Series_example:
A    20
B    30
C    40
D    55
dtype: int64

In [4]:
#creating an ddisplaying an array of numbers
number_list = np.arange(0,10)
number_list

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [5]:
#Checking the data type of a variable
type(number_list)

numpy.ndarray

In [6]:
#Creating variables
list1 = ["Khalfan","Munira","Kirui","Fatma","Marvel","Aphye","Johnix","Amina"]
list2 = [20,35,40,33,22,12,18,29]
list3 = ["Male","Female","Male","Female","Female","Female","Male","Female"]

In [11]:
#Creating a dataframe for the variables
students=pd.DataFrame({"Name":list1,
                       "Age":list2,
                       "Gender":list3})
students

      Name  Age  Gender
0  Khalfan   20    Male
1   Munira   35  Female
2    Kirui   40    Male
3    Fatma   33  Female
4   Marvel   22  Female
5    Aphye   12  Female
6   Johnix   18    Male
7    Amina   29  Female

In [12]:
#Creating a series from the variables
students_series = pd.Series({"Name":list1,
                            "Age":list2,
                            "Gender":list3})
students_series

Name      [Khalfan, Munira, Kirui, Fatma, Marvel, Aphye,...
Age                        [20, 35, 40, 33, 22, 12, 18, 29]
Gender    [Male, Female, Male, Female, Female, Female, M...
dtype: object

In [14]:
pd.Series(students["Name"])

0    Khalfan
1     Munira
2      Kirui
3      Fatma
4     Marvel
5      Aphye
6     Johnix
7      Amina
Name: Name, dtype: object

In [15]:
students.head()

      Name  Age  Gender
0  Khalfan   20    Male
1   Munira   35  Female
2    Kirui   40    Male
3    Fatma   33  Female
4   Marvel   22  Female

In [16]:
students.head(3)

      Name  Age  Gender
0  Khalfan   20    Male
1   Munira   35  Female
2    Kirui   40    Male

In [18]:
students.tail(3)

     Name  Age  Gender
5   Aphye   12  Female
6  Johnix   18    Male
7   Amina   29  Female

In [19]:
#Finding general nfo. on the dataframe
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [20]:
#Finding unique values in list
students["Age"].unique()

array([20, 35, 40, 33, 22, 12, 18, 29], dtype=int64)

In [21]:
#General statistical summary of the dataframe
#Adding include helps in specifying the specific column
students.describe(include="all")

           Name        Age  Gender
count         8   8.000000       8
unique        8        NaN       2
top     Khalfan        NaN  Female
freq          1        NaN       5
mean        NaN  26.125000     NaN
std         NaN   9.613049     NaN
min         NaN  12.000000     NaN
25%         NaN  19.500000     NaN
50%         NaN  25.500000     NaN
75%         NaN  33.500000     NaN
max         NaN  40.000000     NaN